1. pandas を pd のエイリアスでimportする

In [1]:
import pandas as pd

2. pandasのバージョンを表示する

In [2]:
print(pd.__version__)

1.0.1

3. DataFrameの作成

In [3]:
import numpy as np

data = {'shop_name': ['*ownson', '*ownson', '*aikin', '*atsukiyo','*atsukiyo',
                      '*ownson', '*aikin', '*ownson', '*atsukiyo', '*atsukiyo', '*ownson', '*aikin', '*ownson'],
        'sales': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3,2,3,np.nan],
        'visits': [10, 31, 24, 39, np.nan, 31, 10, 16, 27, 12,np.nan,12,np.nan],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no',np.nan ,np.nan, np.nan]}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm']

df = pd.DataFrame(data,labels)
print(df)

   shop_name  sales  visits priority
a    *ownson    2.5    10.0      yes
b    *ownson    3.0    31.0      yes
c     *aikin    0.5    24.0       no
d  *atsukiyo    NaN    39.0      yes
e  *atsukiyo    5.0     NaN       no
f    *ownson    2.0    31.0       no
g     *aikin    4.5    10.0       no
h    *ownson    NaN    16.0      yes
i  *atsukiyo    7.0    27.0       no
j  *atsukiyo    3.0    12.0       no
k    *ownson    2.0     NaN      NaN
l     *aikin    3.0    12.0      NaN
m    *ownson    NaN     NaN      NaN

4. 全体の平均売り上げを示す

In [4]:
sales_mean = df.mean()["sales"]
print(sales_mean)

3.25

5. 欠損値の穴埋め

各カラムの欠損値を以下のように穴埋めする

sales:平均
visits:0
priority:"no_comment"

In [5]:
df.loc[df['sales'].isnull(), 'sales'] = sales_mean 
df.loc[df['visits'].isnull(), 'visits'] = 0 
df.loc[df['priority'].isnull(), 'priority'] = "no_comment"
print(df)

   shop_name  sales  visits    priority
a    *ownson   2.50    10.0         yes
b    *ownson   3.00    31.0         yes
c     *aikin   0.50    24.0          no
d  *atsukiyo   3.25    39.0         yes
e  *atsukiyo   5.00     0.0          no
f    *ownson   2.00    31.0          no
g     *aikin   4.50    10.0          no
h    *ownson   3.25    16.0         yes
i  *atsukiyo   7.00    27.0          no
j  *atsukiyo   3.00    12.0          no
k    *ownson   2.00     0.0  no_comment
l     *aikin   3.00    12.0  no_comment
m    *ownson   3.25     0.0  no_comment

6. 店舗名ごとの平均売り上げを求める

店舗名はshop_nameにあるデータを、売り上げはsalesにあるデータを用いて求めること

In [6]:
shops_mean = df.groupby("shop_name").mean()["sales"]
print(shops_mean)

shop_name
*aikin       2.666667
*atsukiyo    4.562500
*ownson      2.666667
Name: sales, dtype: float64

7.店舗名ごとに店舗数をカウント

店舗名はshop_nameにあるデータを用いること

In [7]:
shops_num = df.groupby("shop_name").size()
shops_num

shop_name
*aikin       3
*atsukiyo    4
*ownson      6
dtype: int64

8. データフレームの作成し、欠損値NaNを前後の値から補完する

In [8]:
data_2 = {'Id_CategoryName':['2_beauty','42_Others','8_coSmeTics','9_e-BOOK','10_finance'],
        'AdNumber':[10045.0,np.nan,10065.0,np.nan,10085.0],
        'CreativeIds':[[23, 47],[],[24, 43, 87],[13],[67, 32]],
        'Client':['GlobalBeuaty(!#)','<TohoGas (12)>','(Medics healthcare. )','12. Every news','"R cards"']
       }
df_2 = pd.DataFrame(data_2)
df_2['AdNumber'] = df_2['AdNumber'].interpolate()
df_2

  Id_CategoryName  AdNumber   CreativeIds                 Client
0        2_beauty   10045.0      [23, 47]       GlobalBeuaty(!#)
1       42_Others   10055.0            []         <TohoGas (12)>
2     8_coSmeTics   10065.0  [24, 43, 87]  (Medics healthcare. )
3        9_e-BOOK   10075.0          [13]         12. Every news
4      10_finance   10085.0      [67, 32]              "R cards"

9. 列データの分割

In [9]:
df_idcn = df_2['Id_CategoryName'].str.split('_', expand=True).rename(columns={0:'Id',1:'CategoryName'})
df_idcn['CategoryName'] = df_idcn['CategoryName'].str.capitalize()
df_idcn

   Id CategoryName
0   2       Beauty
1  42       Others
2   8    Cosmetics
3   9       E-book
4  10      Finance

10. 列データの削除とテーブルの結合

In [10]:
df_2 = df_2.drop('Id_CategoryName', axis=1)
df_2 = pd.concat([df_2, df_idcn], axis='columns')
df_2

   AdNumber   CreativeIds                 Client  Id CategoryName
0   10045.0      [23, 47]       GlobalBeuaty(!#)   2       Beauty
1   10055.0            []         <TohoGas (12)>  42       Others
2   10065.0  [24, 43, 87]  (Medics healthcare. )   8    Cosmetics
3   10075.0          [13]         12. Every news   9       E-book
4   10085.0      [67, 32]              "R cards"  10      Finance

11. 文字データの置換

In [11]:
df_2['Client'] = df_2['Client'].str.replace('[!#()<>."1-9]', '')
df_2

   AdNumber   CreativeIds              Client  Id CategoryName
0   10045.0      [23, 47]        GlobalBeuaty   2       Beauty
1   10055.0            []            TohoGas   42       Others
2   10065.0  [24, 43, 87]  Medics healthcare    8    Cosmetics
3   10075.0          [13]          Every news   9       E-book
4   10085.0      [67, 32]             R cards  10      Finance

12. 複数データを含むカラムの整形

In [12]:
crea_columns = pd.DataFrame(df_2['CreativeIds'].tolist()).rename(columns=lambda x: "Creative_" + str(x+1))
df_2 = df_2.drop('CreativeIds', axis=1)
df_2 = pd.concat([df_2, crea_columns], axis='columns')
df_2

,AdNumber,Client,Id,CategoryName,Creative_1,Creative_2,Creative_3
0,10045.0,GlobalBeuaty,2,Beauty,23.0,47.0,NaN
1,10055.0,TohoGas,42,Others,NaN,NaN,NaN
2,10065.0,Medics healthcare,8,Cosmetics,24.0,43.0,87.0
3,10075.0,Every news,9,E-book,13.0,NaN,NaN
4,10085.0,R cards,10,Finance,67.0,32.0,NaN

13. データフレームの可視化

In [13]:
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')
df = pd.DataFrame({"xs":[1,5,2,8,1], "ys":[4,2,1,9,6]})
plt.scatter(df['xs'].values,df['ys'].values)

array([1, 5, 2, 8, 1], dtype=int64)